api/spec/fixtures/stripe/2020-08-27/webhooks/charge_dispute_closed.json

{
  "id": "evt_3OzgpDH4tiDZlIUa09cnGOsO",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1711724294,
  "data": {
    "object": {
      "id": "dp_1OzgpEH4tiDZlIUaZ8iWQMsb",
      "object": "dispute",
      "amount": 4516,
      "balance_transaction": "txn_1OzgpEH4tiDZlIUaXu3PFSnM",
      "balance_transactions": [
        {
          "id": "txn_1OzgpEH4tiDZlIUaXu3PFSnM",
          "object": "balance_transaction",
          "amount": -4516,
          "available_on": 1712275200,
          "created": 1711724076,
          "currency": "usd",
          "description": "Chargeback withdrawal for ch_3OzgpDH4tiDZlIUa0M7QchGT",
          "exchange_rate": null,
          "fee": 2000,
          "fee_details": [
            {
              "amount": 2000,
              "application": null,
              "currency": "usd",
              "description": "Dispute fee",
              "type": "stripe_fee"
            }
          ],
          "net": -6516,
          "reporting_category": "dispute",
          "source": "dp_1OzgpEH4tiDZlIUaZ8iWQMsb",
          "status": "pending",
          "type": "adjustment"
        }
      ],
      "charge": "ch_3OzgpDH4tiDZlIUa0M7QchGT",
      "created": 1711724076,
      "currency": "usd",
      "evidence": {
        "access_activity_log": null,
        "billing_address": null,
        "cancellation_policy": null,
        "cancellation_policy_disclosure": null,
        "cancellation_rebuttal": null,
        "customer_communication": null,
        "customer_email_address": null,
        "customer_name": "i_stripe_3",
        "customer_purchase_ip": null,
        "customer_signature": null,
        "duplicate_charge_documentation": null,
        "duplicate_charge_explanation": null,
        "duplicate_charge_id": null,
        "product_description": null,
        "receipt": null,
        "refund_policy": null,
        "refund_policy_disclosure": null,
        "refund_refusal_explanation": null,
        "service_date": null,
        "service_documentation": null,
        "shipping_address": null,
        "shipping_carrier": null,
        "shipping_date": null,
        "shipping_documentation": null,
        "shipping_tracking_number": null,
        "uncategorized_file": null,
        "uncategorized_text": null
      },
      "evidence_details": {
        "due_by": 1712534399,
        "has_evidence": false,
        "past_due": false,
        "submission_count": 0
      },
      "is_charge_refundable": false,
      "livemode": false,
      "metadata": {},
      "payment_intent": "pi_3OzgpDH4tiDZlIUa0Ezzggtg",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "network_reason_code": "83"
        },
        "type": "card"
      },
      "reason": "fraudulent",
      "status": "lost"
    },
    "previous_attributes": {
      "status": "needs_response"
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_Lb7Yp8XdgG2n7N",
    "idempotency_key": "[FILTERED]"
  },
  "type": "charge.dispute.closed",
  "organization_id": "57e0597e-3cc5-4496-a46b-ac29b9439ab9"
}
